Revit 2027 API
View.GetCalloutParentId Method
 Gets ID of the callout parent view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetCalloutParentId()
Public Function GetCalloutParentId As ElementId
public:
ElementId^ GetCalloutParentId()
member GetCalloutParentId : unit -> ElementId
Return Value
ElementId
 ID of a view in which this callout was created or InvalidElementId if there is no parent.
Exceptions
Exception | Condition
InvalidOperationException |  This view is not a callout.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace